enchant();
window.onload = function() {
    var game = new Game(400, 800);
    game.fps = 30;
    // マップ用画像の読み込み
    game.preload('img/rgbw.png');

    game.onload = function() {
        //game.rootScene.backgroundColor = "#000000";
// 16x16 pxのサイズでマップオブジェクトの用意
        var map = new Map(40, 40);
        // マップオブジェクトに画像を登録
        map.image = game.assets['img/rgbw.png'];
        // 配列でマップデータを用意する
        var mapArray = [
            [ 4, 4, 4, 4, 4, 4, 4, 4, 4, 4 ],
            [ 4, 0, 0, 0, 0, 0, 0, 0, 5, 5 ],
            [ 4, 0, 0, 0, 0, 0, 0, 0, 5, 5 ],
            [ 4, 0, 0, 0, 0, 0, 0, 0, 5, 5 ],
            [ 4, 0, 0, 0, 0, 0, 0, 0, 5, 5 ],
            [ 4, 0, 0, 0, 0, 0, 0, 0, 5, 5 ],
            [ 4, 0, 0, 0, 0, 0, 0, 0, 5, 5 ],
            [ 4, 0, 0, 0, 0, 0, 0, 0, 5, 5 ],
            [ 4, 0, 0, 0, 0, 0, 0, 0, 5, 5 ],
            [ 4, 0, 0, 0, 0, 0, 0, 0, 5, 5 ],
            [ 4, 0, 0, 0, 0, 0, 0, 0, 5, 5 ],
            [ 4, 0, 0, 0, 0, 0, 0, 0, 5, 5 ],
            [ 4, 0, 0, 0, 0, 0, 0, 0, 5, 5 ],
            [ 4, 0, 0, 0, 0, 0, 0, 0, 5, 5 ],
            [ 4, 0, 0, 0, 0, 0, 0, 0, 5, 5 ],
            [ 4, 0, 0, 0, 0, 0, 0, 0, 5, 5 ],
            [ 4, 0, 0, 0, 0, 0, 0, 0, 5, 5 ],
            [ 4, 0, 0, 0, 0, 0, 0, 0, 5, 5 ],
            [ 4, 0, 0, 0, 0, 0, 0, 0, 5, 5 ],
            [ 4, 4, 4, 4, 4, 4, 4, 4, 5, 5 ]
        ];
        // マップデータをマップオブジェクトに渡す
        map.loadData(mapArray);
        // シーンにマップオブジェクトを渡してシーンに描画する
        game.rootScene.addChild(map);
        
    };
    game.start();
}